{"format": "graph-model", "generatedBy": "2.7.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "signature": {"inputs": {"input_2": {"name": "input_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "42"}]}}}, "outputs": {"value": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "policy": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "7"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/fiar_model/tf.__operators__.getitem_2/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/fiar_model/tf.__operators__.getitem_2/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/fiar_model/tf.__operators__.getitem_2/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/fiar_model/conv1d_2/Conv1D/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/fiar_model/conv1d_2/Conv1D/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fiar_model/conv1d_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fiar_model/batch_normalization_6/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/fiar_model/batch_normalization_6/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fiar_model/flatten_6/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/fiar_model/policy/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2132"}, {"size": "7"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fiar_model/policy/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}]}}}}}, {"name": "StatefulPartitionedCall/fiar_model/flatten_5/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/fiar_model/tf.__operators__.add_1/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/fiar_model/tf.one_hot_1/one_hot/depth", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/fiar_model/tf.one_hot_1/one_hot/on_value", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fiar_model/tf.one_hot_1/one_hot/off_value", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/fiar_model/tf.reshape_1/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/fiar_model/flatten_4/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/fiar_model/tf.concat_1/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/fiar_model/tf.__operators__.getitem_3/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/fiar_model/tf.__operators__.getitem_3/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/fiar_model/tf.__operators__.getitem_3/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/fiar_model/conv1d_3/Conv1D/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/fiar_model/conv1d_3/Conv1D/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fiar_model/conv1d_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fiar_model/batch_normalization_7/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fiar_model/batch_normalization_7/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/fiar_model/flatten_7/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/fiar_model/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1066"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fiar_model/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fiar_model/value/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/fiar_model/value/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_2", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "42"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fiar_model/conv2d_2/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "3"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fiar_model/conv2d_2/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fiar_model/conv2d_3/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fiar_model/conv2d_3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fiar_model/flatten_5/Reshape", "op": "Reshape", "input": ["input_2", "StatefulPartitionedCall/fiar_model/flatten_5/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/fiar_model/tf.__operators__.add_1/AddV2", "op": "AddV2", "input": ["input_2", "StatefulPartitionedCall/fiar_model/tf.__operators__.add_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fiar_model/tf.cast_2/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/fiar_model/tf.__operators__.add_1/AddV2"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/fiar_model/tf.one_hot_1/one_hot", "op": "OneHot", "input": ["StatefulPartitionedCall/fiar_model/tf.cast_2/Cast", "StatefulPartitionedCall/fiar_model/tf.one_hot_1/one_hot/depth", "StatefulPartitionedCall/fiar_model/tf.one_hot_1/one_hot/on_value", "StatefulPartitionedCall/fiar_model/tf.one_hot_1/one_hot/off_value"], "attr": {"axis": {"i": "-1"}, "TI": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fiar_model/tf.reshape_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/fiar_model/tf.one_hot_1/one_hot", "StatefulPartitionedCall/fiar_model/tf.reshape_1/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fiar_model/re_lu_3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/fiar_model/tf.reshape_1/Reshape", "StatefulPartitionedCall/fiar_model/conv2d_2/Conv2D_weights", "StatefulPartitionedCall/fiar_model/conv2d_2/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/fiar_model/batch_normalization_5/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/fiar_model/re_lu_3/Relu", "StatefulPartitionedCall/fiar_model/conv2d_3/Conv2D_weights", "StatefulPartitionedCall/fiar_model/conv2d_3/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/fiar_model/flatten_4/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/fiar_model/batch_normalization_5/FusedBatchNormV3", "StatefulPartitionedCall/fiar_model/flatten_4/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/fiar_model/tf.concat_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/fiar_model/flatten_5/Reshape", "StatefulPartitionedCall/fiar_model/flatten_4/Reshape", "StatefulPartitionedCall/fiar_model/tf.concat_1/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/fiar_model/residual_tower/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/fiar_model/tf.concat_1/concat"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fiar_model/tf.__operators__.getitem_2/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/fiar_model/residual_tower/Relu", "StatefulPartitionedCall/fiar_model/tf.__operators__.getitem_2/strided_slice/stack", "StatefulPartitionedCall/fiar_model/tf.__operators__.getitem_2/strided_slice/stack_1", "StatefulPartitionedCall/fiar_model/tf.__operators__.getitem_2/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "1"}, "shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "2"}, "end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fiar_model/tf.__operators__.getitem_3/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/fiar_model/residual_tower/Relu", "StatefulPartitionedCall/fiar_model/tf.__operators__.getitem_3/strided_slice/stack", "StatefulPartitionedCall/fiar_model/tf.__operators__.getitem_3/strided_slice/stack_1", "StatefulPartitionedCall/fiar_model/tf.__operators__.getitem_3/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "2"}, "shrink_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/fiar_model/conv1d_2/Conv1D/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/fiar_model/tf.__operators__.getitem_2/strided_slice", "StatefulPartitionedCall/fiar_model/conv1d_2/Conv1D/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fiar_model/conv1d_3/Conv1D/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/fiar_model/tf.__operators__.getitem_3/strided_slice", "StatefulPartitionedCall/fiar_model/conv1d_3/Conv1D/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fiar_model/conv1d_2/Conv1D", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/fiar_model/conv1d_2/Conv1D/ExpandDims", "StatefulPartitionedCall/fiar_model/conv1d_2/Conv1D/ExpandDims_1", "StatefulPartitionedCall/fiar_model/conv1d_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/fiar_model/conv1d_3/Conv1D", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/fiar_model/conv1d_3/Conv1D/ExpandDims", "StatefulPartitionedCall/fiar_model/conv1d_3/Conv1D/ExpandDims_1", "StatefulPartitionedCall/fiar_model/conv1d_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/fiar_model/conv1d_2/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/fiar_model/conv1d_2/Conv1D"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/fiar_model/conv1d_3/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/fiar_model/conv1d_3/Conv1D"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fiar_model/batch_normalization_6/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/fiar_model/conv1d_2/BiasAdd", "StatefulPartitionedCall/fiar_model/batch_normalization_6/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fiar_model/batch_normalization_7/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/fiar_model/conv1d_3/BiasAdd", "StatefulPartitionedCall/fiar_model/batch_normalization_7/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fiar_model/batch_normalization_6/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/fiar_model/batch_normalization_6/batchnorm/mul_1", "StatefulPartitionedCall/fiar_model/batch_normalization_6/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fiar_model/batch_normalization_7/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/fiar_model/batch_normalization_7/batchnorm/mul_1", "StatefulPartitionedCall/fiar_model/batch_normalization_7/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fiar_model/re_lu_4/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/fiar_model/batch_normalization_6/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fiar_model/re_lu_5/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/fiar_model/batch_normalization_7/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fiar_model/flatten_6/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/fiar_model/re_lu_4/Relu", "StatefulPartitionedCall/fiar_model/flatten_6/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/fiar_model/flatten_7/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/fiar_model/re_lu_5/Relu", "StatefulPartitionedCall/fiar_model/flatten_7/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/fiar_model/policy/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/fiar_model/flatten_6/Reshape", "StatefulPartitionedCall/fiar_model/policy/MatMul/ReadVariableOp", "StatefulPartitionedCall/fiar_model/policy/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fiar_model/dense_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/fiar_model/flatten_7/Reshape", "StatefulPartitionedCall/fiar_model/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/fiar_model/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/fiar_model/policy/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/fiar_model/policy/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fiar_model/value/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/fiar_model/dense_1/Relu", "StatefulPartitionedCall/fiar_model/value/MatMul/ReadVariableOp", "StatefulPartitionedCall/fiar_model/value/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/fiar_model/policy/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fiar_model/value/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/fiar_model/value/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/fiar_model/value/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1087}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/fiar_model/tf.__operators__.getitem_2/strided_slice/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fiar_model/tf.__operators__.getitem_2/strided_slice/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fiar_model/tf.__operators__.getitem_2/strided_slice/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fiar_model/conv1d_2/Conv1D/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fiar_model/conv1d_2/Conv1D/ExpandDims_1", "shape": [1, 1, 1, 2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/fiar_model/conv1d_2/BiasAdd/ReadVariableOp", "shape": [2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/fiar_model/batch_normalization_6/batchnorm/mul", "shape": [2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/fiar_model/batch_normalization_6/batchnorm/sub", "shape": [2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/fiar_model/flatten_6/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fiar_model/policy/MatMul/ReadVariableOp", "shape": [2132, 7], "dtype": "float32"}, {"name": "StatefulPartitionedCall/fiar_model/policy/BiasAdd/ReadVariableOp", "shape": [7], "dtype": "float32"}, {"name": "StatefulPartitionedCall/fiar_model/flatten_5/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fiar_model/tf.__operators__.add_1/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/fiar_model/tf.one_hot_1/one_hot/depth", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fiar_model/tf.one_hot_1/one_hot/on_value", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/fiar_model/tf.one_hot_1/one_hot/off_value", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/fiar_model/tf.reshape_1/Reshape/shape", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fiar_model/flatten_4/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fiar_model/tf.concat_1/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fiar_model/tf.__operators__.getitem_3/strided_slice/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fiar_model/tf.__operators__.getitem_3/strided_slice/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fiar_model/tf.__operators__.getitem_3/strided_slice/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fiar_model/conv1d_3/Conv1D/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fiar_model/conv1d_3/Conv1D/ExpandDims_1", "shape": [1, 1, 1, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/fiar_model/conv1d_3/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/fiar_model/batch_normalization_7/batchnorm/mul", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/fiar_model/batch_normalization_7/batchnorm/sub", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/fiar_model/flatten_7/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fiar_model/dense_1/MatMul/ReadVariableOp", "shape": [1066, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/fiar_model/dense_1/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/fiar_model/value/MatMul/ReadVariableOp", "shape": [256, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/fiar_model/value/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/fiar_model/conv2d_2/Conv2D_weights", "shape": [4, 4, 3, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/fiar_model/conv2d_2/Conv2D_bn_offset", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/fiar_model/conv2d_3/Conv2D_weights", "shape": [2, 3, 256, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/fiar_model/conv2d_3/Conv2D_bn_offset", "shape": [256], "dtype": "float32"}]}]}