{"format": "graph-model", "generatedBy": "2.7.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "signature": {"inputs": {"input_2": {"name": "input_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "9"}]}}}, "outputs": {"value": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "policy": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "9"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem_2/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem_2/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem_2/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d_2/Conv1D/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d_2/Conv1D/ExpandDims_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/batch_normalization_6/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/batch_normalization_6/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/flatten_6/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/policy/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "540"}, {"size": "9"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/policy/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/flatten_5/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.add_1/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot_1/one_hot/depth", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot_1/one_hot/on_value", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot_1/one_hot/off_value", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.reshape_1/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/flatten_4/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.concat_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem_3/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem_3/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem_3/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d_3/Conv1D/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d_3/Conv1D/ExpandDims_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/batch_normalization_7/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/batch_normalization_7/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/flatten_7/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "270"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/value/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/value/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "input_2", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "9"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/conv2d_2/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "243"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/conv2d_2/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "243"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/conv2d_3/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "243"}, {"size": "243"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/conv2d_3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "243"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.add_1/AddV2", "op": "AddV2", "input": ["input_2", "StatefulPartitionedCall/tictactoe_model/tf.__operators__.add_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.cast_2/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/tictactoe_model/tf.__operators__.add_1/AddV2"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot_1/one_hot", "op": "OneHot", "input": ["StatefulPartitionedCall/tictactoe_model/tf.cast_2/Cast", "StatefulPartitionedCall/tictactoe_model/tf.one_hot_1/one_hot/depth", "StatefulPartitionedCall/tictactoe_model/tf.one_hot_1/one_hot/on_value", "StatefulPartitionedCall/tictactoe_model/tf.one_hot_1/one_hot/off_value"], "attr": {"T": {"type": "DT_FLOAT"}, "axis": {"i": "-1"}, "TI": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/flatten_5/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/tictactoe_model/tf.one_hot_1/one_hot", "StatefulPartitionedCall/tictactoe_model/flatten_5/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.reshape_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/tictactoe_model/tf.one_hot_1/one_hot", "StatefulPartitionedCall/tictactoe_model/tf.reshape_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/re_lu_3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/tictactoe_model/tf.reshape_1/Reshape", "StatefulPartitionedCall/tictactoe_model/conv2d_2/Conv2D_weights", "StatefulPartitionedCall/tictactoe_model/conv2d_2/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/batch_normalization_5/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/tictactoe_model/re_lu_3/Relu", "StatefulPartitionedCall/tictactoe_model/conv2d_3/Conv2D_weights", "StatefulPartitionedCall/tictactoe_model/conv2d_3/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/flatten_4/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/tictactoe_model/batch_normalization_5/FusedBatchNormV3", "StatefulPartitionedCall/tictactoe_model/flatten_4/Const"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.concat_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/tictactoe_model/flatten_5/Reshape", "StatefulPartitionedCall/tictactoe_model/flatten_4/Reshape", "StatefulPartitionedCall/tictactoe_model/tf.concat_1/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/residual_tower/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/tictactoe_model/tf.concat_1/concat"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem_2/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/tictactoe_model/residual_tower/Relu", "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem_2/strided_slice/stack", "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem_2/strided_slice/stack_1", "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem_2/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "2"}, "ellipsis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem_3/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/tictactoe_model/residual_tower/Relu", "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem_3/strided_slice/stack", "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem_3/strided_slice/stack_1", "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem_3/strided_slice/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "2"}, "ellipsis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d_2/Conv1D/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem_2/strided_slice", "StatefulPartitionedCall/tictactoe_model/conv1d_2/Conv1D/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d_3/Conv1D/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem_3/strided_slice", "StatefulPartitionedCall/tictactoe_model/conv1d_3/Conv1D/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d_2/Conv1D", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/tictactoe_model/conv1d_2/Conv1D/ExpandDims", "StatefulPartitionedCall/tictactoe_model/conv1d_2/Conv1D/ExpandDims_1", "StatefulPartitionedCall/tictactoe_model/conv1d_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d_3/Conv1D", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/tictactoe_model/conv1d_3/Conv1D/ExpandDims", "StatefulPartitionedCall/tictactoe_model/conv1d_3/Conv1D/ExpandDims_1", "StatefulPartitionedCall/tictactoe_model/conv1d_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d_2/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/tictactoe_model/conv1d_2/Conv1D"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d_3/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/tictactoe_model/conv1d_3/Conv1D"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/batch_normalization_6/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/tictactoe_model/conv1d_2/BiasAdd", "StatefulPartitionedCall/tictactoe_model/batch_normalization_6/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/batch_normalization_7/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/tictactoe_model/conv1d_3/BiasAdd", "StatefulPartitionedCall/tictactoe_model/batch_normalization_7/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/batch_normalization_6/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/tictactoe_model/batch_normalization_6/batchnorm/mul_1", "StatefulPartitionedCall/tictactoe_model/batch_normalization_6/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/batch_normalization_7/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/tictactoe_model/batch_normalization_7/batchnorm/mul_1", "StatefulPartitionedCall/tictactoe_model/batch_normalization_7/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/re_lu_4/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/tictactoe_model/batch_normalization_6/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/re_lu_5/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/tictactoe_model/batch_normalization_7/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/flatten_6/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/tictactoe_model/re_lu_4/Relu", "StatefulPartitionedCall/tictactoe_model/flatten_6/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/flatten_7/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/tictactoe_model/re_lu_5/Relu", "StatefulPartitionedCall/tictactoe_model/flatten_7/Const"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/policy/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/tictactoe_model/flatten_6/Reshape", "StatefulPartitionedCall/tictactoe_model/policy/MatMul/ReadVariableOp", "StatefulPartitionedCall/tictactoe_model/policy/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/tictactoe_model/flatten_7/Reshape", "StatefulPartitionedCall/tictactoe_model/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/tictactoe_model/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/policy/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/tictactoe_model/policy/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/value/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/tictactoe_model/dense_1/Relu", "StatefulPartitionedCall/tictactoe_model/value/MatMul/ReadVariableOp", "StatefulPartitionedCall/tictactoe_model/value/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/tictactoe_model/policy/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/value/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/tictactoe_model/value/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/tictactoe_model/value/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1087}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem_2/strided_slice/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem_2/strided_slice/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem_2/strided_slice/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d_2/Conv1D/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d_2/Conv1D/ExpandDims_1", "shape": [1, 1, 1, 2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d_2/BiasAdd/ReadVariableOp", "shape": [2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/batch_normalization_6/batchnorm/mul", "shape": [2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/batch_normalization_6/batchnorm/sub", "shape": [2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/flatten_6/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/policy/MatMul/ReadVariableOp", "shape": [540, 9], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/policy/BiasAdd/ReadVariableOp", "shape": [9], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/flatten_5/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.add_1/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot_1/one_hot/depth", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot_1/one_hot/on_value", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot_1/one_hot/off_value", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.reshape_1/Reshape/shape", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/flatten_4/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.concat_1/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem_3/strided_slice/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem_3/strided_slice/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem_3/strided_slice/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d_3/Conv1D/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d_3/Conv1D/ExpandDims_1", "shape": [1, 1, 1, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d_3/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/batch_normalization_7/batchnorm/mul", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/batch_normalization_7/batchnorm/sub", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/flatten_7/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_1/MatMul/ReadVariableOp", "shape": [270, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_1/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/value/MatMul/ReadVariableOp", "shape": [256, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/value/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/conv2d_2/Conv2D_weights", "shape": [3, 3, 3, 243], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/conv2d_2/Conv2D_bn_offset", "shape": [243], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/conv2d_3/Conv2D_weights", "shape": [1, 1, 243, 243], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/conv2d_3/Conv2D_bn_offset", "shape": [243], "dtype": "float32"}]}]}