{"format": "graph-model", "generatedBy": "2.7.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "signature": {"inputs": {"input_5": {"name": "input_5:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "9"}]}}}, "outputs": {"mask_played_4": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "9"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/tictactoe_model/mask_played_4/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot_4/one_hot/depth", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot_4/one_hot/on_value", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot_4/one_hot/off_value", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/flatten_5/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_26/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "27"}, {"size": "81"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_26/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "81"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_27/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "81"}, {"size": "81"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_27/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "81"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_28/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "81"}, {"size": "81"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_28/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "81"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_29/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "81"}, {"size": "81"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_29/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "81"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_30/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "81"}, {"size": "81"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_30/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "81"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.concat_4/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_31/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "108"}, {"size": "9"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_31/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_5", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "9"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/mask_played_4/Equal", "op": "Equal", "input": ["input_5", "StatefulPartitionedCall/tictactoe_model/mask_played_4/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.cast_4/Cast", "op": "Cast", "input": ["input_5"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot_4/one_hot", "op": "OneHot", "input": ["StatefulPartitionedCall/tictactoe_model/tf.cast_4/Cast", "StatefulPartitionedCall/tictactoe_model/tf.one_hot_4/one_hot/depth", "StatefulPartitionedCall/tictactoe_model/tf.one_hot_4/one_hot/on_value", "StatefulPartitionedCall/tictactoe_model/tf.one_hot_4/one_hot/off_value"], "attr": {"axis": {"i": "-1"}, "TI": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/flatten_5/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/tictactoe_model/tf.one_hot_4/one_hot", "StatefulPartitionedCall/tictactoe_model/flatten_5/Const"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_26/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/tictactoe_model/flatten_5/Reshape", "StatefulPartitionedCall/tictactoe_model/dense_26/MatMul/ReadVariableOp", "StatefulPartitionedCall/tictactoe_model/dense_26/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_27/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/tictactoe_model/dense_26/LeakyRelu", "StatefulPartitionedCall/tictactoe_model/dense_27/MatMul/ReadVariableOp", "StatefulPartitionedCall/tictactoe_model/dense_27/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_28/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/tictactoe_model/dense_27/LeakyRelu", "StatefulPartitionedCall/tictactoe_model/dense_28/MatMul/ReadVariableOp", "StatefulPartitionedCall/tictactoe_model/dense_28/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_29/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/tictactoe_model/dense_28/LeakyRelu", "StatefulPartitionedCall/tictactoe_model/dense_29/MatMul/ReadVariableOp", "StatefulPartitionedCall/tictactoe_model/dense_29/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_30/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/tictactoe_model/dense_29/LeakyRelu", "StatefulPartitionedCall/tictactoe_model/dense_30/MatMul/ReadVariableOp", "StatefulPartitionedCall/tictactoe_model/dense_30/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.concat_4/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/tictactoe_model/flatten_5/Reshape", "StatefulPartitionedCall/tictactoe_model/dense_30/LeakyRelu", "StatefulPartitionedCall/tictactoe_model/tf.concat_4/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_31/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/tictactoe_model/tf.concat_4/concat", "StatefulPartitionedCall/tictactoe_model/dense_31/MatMul/ReadVariableOp", "StatefulPartitionedCall/tictactoe_model/dense_31/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/tictactoe_model/mask_played_4/zeros_like", "op": "ZerosLike", "input": ["StatefulPartitionedCall/tictactoe_model/dense_31/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/mask_played_4/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/tictactoe_model/mask_played_4/Equal", "StatefulPartitionedCall/tictactoe_model/dense_31/BiasAdd", "StatefulPartitionedCall/tictactoe_model/mask_played_4/zeros_like"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/tictactoe_model/mask_played_4/SelectV2"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1087}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/tictactoe_model/mask_played_4/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot_4/one_hot/depth", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot_4/one_hot/on_value", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot_4/one_hot/off_value", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/flatten_5/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_26/MatMul/ReadVariableOp", "shape": [27, 81], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_26/BiasAdd/ReadVariableOp", "shape": [81], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_27/MatMul/ReadVariableOp", "shape": [81, 81], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_27/BiasAdd/ReadVariableOp", "shape": [81], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_28/MatMul/ReadVariableOp", "shape": [81, 81], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_28/BiasAdd/ReadVariableOp", "shape": [81], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_29/MatMul/ReadVariableOp", "shape": [81, 81], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_29/BiasAdd/ReadVariableOp", "shape": [81], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_30/MatMul/ReadVariableOp", "shape": [81, 81], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_30/BiasAdd/ReadVariableOp", "shape": [81], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.concat_4/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_31/MatMul/ReadVariableOp", "shape": [108, 9], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_31/BiasAdd/ReadVariableOp", "shape": [9], "dtype": "float32"}]}]}