{"format": "graph-model", "generatedBy": "2.7.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "signature": {"inputs": {"input_4": {"name": "input_4:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "9"}]}}}, "outputs": {"mask_played_3": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "9"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/tictactoe_model/mask_played_3/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot_3/one_hot/depth", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot_3/one_hot/on_value", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot_3/one_hot/off_value", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/flatten_4/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_20/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "27"}, {"size": "81"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_20/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "81"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_21/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "81"}, {"size": "81"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_21/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "81"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_22/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "81"}, {"size": "81"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_22/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "81"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_23/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "81"}, {"size": "81"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_23/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "81"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_24/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "81"}, {"size": "81"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_24/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "81"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.concat_3/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_25/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "108"}, {"size": "9"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_25/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}]}}}}}, {"name": "input_4", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "9"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/mask_played_3/Equal", "op": "Equal", "input": ["input_4", "StatefulPartitionedCall/tictactoe_model/mask_played_3/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.cast_3/Cast", "op": "Cast", "input": ["input_4"], "attr": {"DstT": {"type": "DT_INT32"}, "SrcT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot_3/one_hot", "op": "OneHot", "input": ["StatefulPartitionedCall/tictactoe_model/tf.cast_3/Cast", "StatefulPartitionedCall/tictactoe_model/tf.one_hot_3/one_hot/depth", "StatefulPartitionedCall/tictactoe_model/tf.one_hot_3/one_hot/on_value", "StatefulPartitionedCall/tictactoe_model/tf.one_hot_3/one_hot/off_value"], "attr": {"axis": {"i": "-1"}, "T": {"type": "DT_FLOAT"}, "TI": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/flatten_4/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/tictactoe_model/tf.one_hot_3/one_hot", "StatefulPartitionedCall/tictactoe_model/flatten_4/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_20/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/tictactoe_model/flatten_4/Reshape", "StatefulPartitionedCall/tictactoe_model/dense_20/MatMul/ReadVariableOp", "StatefulPartitionedCall/tictactoe_model/dense_20/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_21/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/tictactoe_model/dense_20/LeakyRelu", "StatefulPartitionedCall/tictactoe_model/dense_21/MatMul/ReadVariableOp", "StatefulPartitionedCall/tictactoe_model/dense_21/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_22/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/tictactoe_model/dense_21/LeakyRelu", "StatefulPartitionedCall/tictactoe_model/dense_22/MatMul/ReadVariableOp", "StatefulPartitionedCall/tictactoe_model/dense_22/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_23/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/tictactoe_model/dense_22/LeakyRelu", "StatefulPartitionedCall/tictactoe_model/dense_23/MatMul/ReadVariableOp", "StatefulPartitionedCall/tictactoe_model/dense_23/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_24/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/tictactoe_model/dense_23/LeakyRelu", "StatefulPartitionedCall/tictactoe_model/dense_24/MatMul/ReadVariableOp", "StatefulPartitionedCall/tictactoe_model/dense_24/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.concat_3/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/tictactoe_model/flatten_4/Reshape", "StatefulPartitionedCall/tictactoe_model/dense_24/LeakyRelu", "StatefulPartitionedCall/tictactoe_model/tf.concat_3/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_25/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/tictactoe_model/tf.concat_3/concat", "StatefulPartitionedCall/tictactoe_model/dense_25/MatMul/ReadVariableOp", "StatefulPartitionedCall/tictactoe_model/dense_25/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/tictactoe_model/mask_played_3/zeros_like", "op": "ZerosLike", "input": ["StatefulPartitionedCall/tictactoe_model/dense_25/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/mask_played_3/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/tictactoe_model/mask_played_3/Equal", "StatefulPartitionedCall/tictactoe_model/dense_25/BiasAdd", "StatefulPartitionedCall/tictactoe_model/mask_played_3/zeros_like"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/tictactoe_model/mask_played_3/SelectV2"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1087}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/tictactoe_model/mask_played_3/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot_3/one_hot/depth", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot_3/one_hot/on_value", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot_3/one_hot/off_value", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/flatten_4/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_20/MatMul/ReadVariableOp", "shape": [27, 81], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_20/BiasAdd/ReadVariableOp", "shape": [81], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_21/MatMul/ReadVariableOp", "shape": [81, 81], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_21/BiasAdd/ReadVariableOp", "shape": [81], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_22/MatMul/ReadVariableOp", "shape": [81, 81], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_22/BiasAdd/ReadVariableOp", "shape": [81], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_23/MatMul/ReadVariableOp", "shape": [81, 81], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_23/BiasAdd/ReadVariableOp", "shape": [81], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_24/MatMul/ReadVariableOp", "shape": [81, 81], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_24/BiasAdd/ReadVariableOp", "shape": [81], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.concat_3/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_25/MatMul/ReadVariableOp", "shape": [108, 9], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_25/BiasAdd/ReadVariableOp", "shape": [9], "dtype": "float32"}]}]}