{"format": "graph-model", "generatedBy": "2.7.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "signature": {"inputs": {"input_46": {"name": "input_46:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "9"}]}}}, "outputs": {"mask_played_45": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "9"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/tictactoe_model/mask_played_45/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot_45/one_hot/depth", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot_45/one_hot/on_value", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot_45/one_hot/off_value", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/flatten_52/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_290/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "27"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_290/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_291/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_291/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_292/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "9"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_292/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}]}}}}}, {"name": "input_46", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "9"}]}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/mask_played_45/Equal", "op": "Equal", "input": ["input_46", "StatefulPartitionedCall/tictactoe_model/mask_played_45/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.cast_45/Cast", "op": "Cast", "input": ["input_46"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot_45/one_hot", "op": "OneHot", "input": ["StatefulPartitionedCall/tictactoe_model/tf.cast_45/Cast", "StatefulPartitionedCall/tictactoe_model/tf.one_hot_45/one_hot/depth", "StatefulPartitionedCall/tictactoe_model/tf.one_hot_45/one_hot/on_value", "StatefulPartitionedCall/tictactoe_model/tf.one_hot_45/one_hot/off_value"], "attr": {"axis": {"i": "-1"}, "TI": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/flatten_52/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/tictactoe_model/tf.one_hot_45/one_hot", "StatefulPartitionedCall/tictactoe_model/flatten_52/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_290/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/tictactoe_model/flatten_52/Reshape", "StatefulPartitionedCall/tictactoe_model/dense_290/MatMul/ReadVariableOp", "StatefulPartitionedCall/tictactoe_model/dense_290/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_291/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/tictactoe_model/dense_290/LeakyRelu", "StatefulPartitionedCall/tictactoe_model/dense_291/MatMul/ReadVariableOp", "StatefulPartitionedCall/tictactoe_model/dense_291/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_292/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/tictactoe_model/dense_291/LeakyRelu", "StatefulPartitionedCall/tictactoe_model/dense_292/MatMul/ReadVariableOp", "StatefulPartitionedCall/tictactoe_model/dense_292/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_292/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/tictactoe_model/dense_292/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/mask_played_45/zeros_like", "op": "ZerosLike", "input": ["StatefulPartitionedCall/tictactoe_model/dense_292/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/mask_played_45/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/tictactoe_model/mask_played_45/Equal", "StatefulPartitionedCall/tictactoe_model/dense_292/Sigmoid", "StatefulPartitionedCall/tictactoe_model/mask_played_45/zeros_like"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/tictactoe_model/mask_played_45/SelectV2"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1087}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/tictactoe_model/mask_played_45/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot_45/one_hot/depth", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot_45/one_hot/on_value", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot_45/one_hot/off_value", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/flatten_52/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_290/MatMul/ReadVariableOp", "shape": [27, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_290/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_291/MatMul/ReadVariableOp", "shape": [256, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_291/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_292/MatMul/ReadVariableOp", "shape": [256, 9], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense_292/BiasAdd/ReadVariableOp", "shape": [9], "dtype": "float32"}]}]}