{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.15.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "9"}]}}}, "outputs": {"policy": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "9"}]}}, "value": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d/Conv1D/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d/Conv1D/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/batch_normalization_2/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/batch_normalization_2/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/flatten_2/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/policy/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "540"}, {"size": "9"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/policy/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/flatten_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot/one_hot/depth", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot/one_hot/on_value", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot/one_hot/off_value", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.reshape/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/flatten/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.concat/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d_1/Conv1D/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d_1/Conv1D/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/batch_normalization_3/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/batch_normalization_3/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/flatten_3/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "270"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/value/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/value/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "9"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/conv2d/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "243"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/conv2d/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "243"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/conv2d_1/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "243"}, {"size": "243"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/conv2d_1/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "243"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.add/AddV2", "op": "AddV2", "input": ["input_1", "StatefulPartitionedCall/tictactoe_model/tf.__operators__.add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.cast/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/tictactoe_model/tf.__operators__.add/AddV2"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot/one_hot", "op": "OneHot", "input": ["StatefulPartitionedCall/tictactoe_model/tf.cast/Cast", "StatefulPartitionedCall/tictactoe_model/tf.one_hot/one_hot/depth", "StatefulPartitionedCall/tictactoe_model/tf.one_hot/one_hot/on_value", "StatefulPartitionedCall/tictactoe_model/tf.one_hot/one_hot/off_value"], "attr": {"axis": {"i": "-1"}, "TI": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/flatten_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/tictactoe_model/tf.one_hot/one_hot", "StatefulPartitionedCall/tictactoe_model/flatten_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.reshape/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/tictactoe_model/tf.one_hot/one_hot", "StatefulPartitionedCall/tictactoe_model/tf.reshape/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/re_lu/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/tictactoe_model/tf.reshape/Reshape", "StatefulPartitionedCall/tictactoe_model/conv2d/Conv2D_weights", "StatefulPartitionedCall/tictactoe_model/conv2d/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/batch_normalization_1/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/tictactoe_model/re_lu/Relu", "StatefulPartitionedCall/tictactoe_model/conv2d_1/Conv2D_weights", "StatefulPartitionedCall/tictactoe_model/conv2d_1/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/tictactoe_model/batch_normalization_1/FusedBatchNormV3", "StatefulPartitionedCall/tictactoe_model/flatten/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.concat/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/tictactoe_model/flatten_1/Reshape", "StatefulPartitionedCall/tictactoe_model/flatten/Reshape", "StatefulPartitionedCall/tictactoe_model/tf.concat/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/residual_tower/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/tictactoe_model/tf.concat/concat"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/tictactoe_model/residual_tower/Relu", "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem/strided_slice/stack", "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem/strided_slice/stack_1", "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "2"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/tictactoe_model/residual_tower/Relu", "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem_1/strided_slice/stack", "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem_1/strided_slice/stack_1", "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "2"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d/Conv1D/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem/strided_slice", "StatefulPartitionedCall/tictactoe_model/conv1d/Conv1D/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d_1/Conv1D/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem_1/strided_slice", "StatefulPartitionedCall/tictactoe_model/conv1d_1/Conv1D/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d/Conv1D", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/tictactoe_model/conv1d/Conv1D/ExpandDims", "StatefulPartitionedCall/tictactoe_model/conv1d/Conv1D/ExpandDims_1", "StatefulPartitionedCall/tictactoe_model/conv1d/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d_1/Conv1D", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/tictactoe_model/conv1d_1/Conv1D/ExpandDims", "StatefulPartitionedCall/tictactoe_model/conv1d_1/Conv1D/ExpandDims_1", "StatefulPartitionedCall/tictactoe_model/conv1d_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/tictactoe_model/conv1d/Conv1D"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d_1/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/tictactoe_model/conv1d_1/Conv1D"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/tictactoe_model/batch_normalization_2/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/tictactoe_model/conv1d/BiasAdd", "StatefulPartitionedCall/tictactoe_model/batch_normalization_2/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/batch_normalization_3/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/tictactoe_model/conv1d_1/BiasAdd", "StatefulPartitionedCall/tictactoe_model/batch_normalization_3/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/batch_normalization_2/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/tictactoe_model/batch_normalization_2/batchnorm/mul_1", "StatefulPartitionedCall/tictactoe_model/batch_normalization_2/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/batch_normalization_3/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/tictactoe_model/batch_normalization_3/batchnorm/mul_1", "StatefulPartitionedCall/tictactoe_model/batch_normalization_3/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/re_lu_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/tictactoe_model/batch_normalization_2/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/re_lu_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/tictactoe_model/batch_normalization_3/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/flatten_2/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/tictactoe_model/re_lu_1/Relu", "StatefulPartitionedCall/tictactoe_model/flatten_2/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/flatten_3/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/tictactoe_model/re_lu_2/Relu", "StatefulPartitionedCall/tictactoe_model/flatten_3/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/policy/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/tictactoe_model/flatten_2/Reshape", "StatefulPartitionedCall/tictactoe_model/policy/MatMul/ReadVariableOp", "StatefulPartitionedCall/tictactoe_model/policy/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/dense/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/tictactoe_model/flatten_3/Reshape", "StatefulPartitionedCall/tictactoe_model/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/tictactoe_model/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/policy/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/tictactoe_model/policy/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/value/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/tictactoe_model/dense/Relu", "StatefulPartitionedCall/tictactoe_model/value/MatMul/ReadVariableOp", "StatefulPartitionedCall/tictactoe_model/value/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/tictactoe_model/policy/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/tictactoe_model/value/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/tictactoe_model/value/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/tictactoe_model/value/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1645}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem/strided_slice/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem/strided_slice/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem/strided_slice/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d/Conv1D/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d/Conv1D/ExpandDims_1", "shape": [1, 1, 1, 2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d/BiasAdd/ReadVariableOp", "shape": [2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/batch_normalization_2/batchnorm/mul", "shape": [2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/batch_normalization_2/batchnorm/sub", "shape": [2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/flatten_2/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/policy/MatMul/ReadVariableOp", "shape": [540, 9], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/policy/BiasAdd/ReadVariableOp", "shape": [9], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/flatten_1/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.add/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot/one_hot/depth", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot/one_hot/on_value", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.one_hot/one_hot/off_value", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.reshape/Reshape/shape", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.concat/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem_1/strided_slice/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem_1/strided_slice/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/tf.__operators__.getitem_1/strided_slice/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d_1/Conv1D/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d_1/Conv1D/ExpandDims_1", "shape": [1, 1, 1, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/conv1d_1/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/batch_normalization_3/batchnorm/mul", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/batch_normalization_3/batchnorm/sub", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/flatten_3/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense/MatMul/ReadVariableOp", "shape": [270, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/dense/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/value/MatMul/ReadVariableOp", "shape": [256, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/value/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/conv2d/Conv2D_weights", "shape": [3, 3, 3, 243], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/conv2d/Conv2D_bn_offset", "shape": [243], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/conv2d_1/Conv2D_weights", "shape": [1, 1, 243, 243], "dtype": "float32"}, {"name": "StatefulPartitionedCall/tictactoe_model/conv2d_1/Conv2D_bn_offset", "shape": [243], "dtype": "float32"}]}]}